app/views/site/_header.html.haml

  %ul.nav
    - cache "#{locale}/menu/#{path_for_cache}/#{Refinery::Page.latest.etag}" do
---
SELECT "pages".* FROM "pages" WHERE (page_type = 'public')