app/controllers/posts_controller.rb

SELECT "pages".* FROM "pages" WHERE (page_type = 'public')
---
  def index
  	if params[:category_id]
  		@category =  Category.find(params[:category_id])
  		@posts = @category.posts.page(params[:page]).per(10)