app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (post_type = 'public') ORDER BY created_at, created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (post_type = 'public')
---
  def index
    @posts = Post.order("created_at DESC").page(params[:page]).per(10)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND (is_valid = 1) ORDER BY created_at DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1 AND (user_id = 4 and is_valid = 0)
SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'guests' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
  def show
    @post = Post.find params[:id]
    @comment = @post.comments.build
    @comment.is_valid = 0
    @comments = @post.comments.valid
    @comments_size = @comments.size
    if(current_user.role.name == "users" && @post.comments.has_unvalid_commented(current_user).size > 0)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at LIMIT 1  [["id", "1"]]
---
  def print
    @post = Post.find params[:id]